public/sysbench-tidesql-v4-5-6-innodb-mariadb-v11-8-6-tidesdb-v9.3.6/tidesdb_warmup.log
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 16 tps: 7.70 qps: 171.57 (r/w/o: 122.38/32.19/17.00) lat (ms,95%): 5813.24 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 19.60 qps: 387.01 (r/w/o: 270.61/77.20/39.20) lat (ms,95%): 2198.52 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 16 tps: 19.70 qps: 395.50 (r/w/o: 276.90/79.20/39.40) lat (ms,95%): 2082.91 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 16 tps: 24.20 qps: 485.10 (r/w/o: 340.40/96.30/48.40) lat (ms,95%): 1836.24 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 16 tps: 41.20 qps: 827.60 (r/w/o: 579.70/165.50/82.40) lat (ms,95%): 1170.65 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 16 tps: 35.80 qps: 714.80 (r/w/o: 500.30/142.90/71.60) lat (ms,95%): 1479.41 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            20972
        write:                           5992
        other:                           2996
        total:                           29960
    transactions:                        1498   (22.63 per sec.)
    queries:                             29960  (452.53 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      22.6265
    time elapsed:                        66.2055s
    total number of events:              1498

Latency (ms):
         min:                                    2.40
         avg:                                  650.13
         max:                                21075.85
         95th percentile:                     1938.16
         sum:                               973893.38

Threads fairness:
    events (avg/stddev):           93.6250/9.32
    execution time (avg/stddev):   60.8683/1.46